{
  "_name_or_path": "lawbridge/lawbridge-legal-model",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Uygunsuzluk Yok",
    "1": "Hakaret \u2013 TCK m.125",
    "2": "Tehdit \u2013 TCK m.106",
    "3": "Taciz \u2013 TCK m.105, 123",
    "4": "Nefret / Ayr\u0131mc\u0131l\u0131k \u2013 TCK m.122",
    "5": "Toplumu Kin ve D\u00fc\u015fmanl\u0131\u011fa Tahrik \u2013 TCK m.216",
    "6": "Kamu G\u00f6revlisine Hakaret \u2013 TCK m.125/3",
    "7": "Ay\u0131pl\u0131 Mal / Hizmet \u2013 TKHK m.8, 11",
    "8": "Doland\u0131r\u0131c\u0131l\u0131k / Sahte Kampanya \u2013 TCK m.157",
    "9": "Veri \u0130hlali \u2013 KVKK m.12, TCK m.136"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Ay\u0131pl\u0131 Mal / Hizmet \u2013 TKHK m.8, 11": 7,
    "Doland\u0131r\u0131c\u0131l\u0131k / Sahte Kampanya \u2013 TCK m.157": 8,
    "Hakaret \u2013 TCK m.125": 1,
    "Kamu G\u00f6revlisine Hakaret \u2013 TCK m.125/3": 6,
    "Nefret / Ayr\u0131mc\u0131l\u0131k \u2013 TCK m.122": 4,
    "Taciz \u2013 TCK m.105, 123": 3,
    "Tehdit \u2013 TCK m.106": 2,
    "Toplumu Kin ve D\u00fc\u015fmanl\u0131\u011fa Tahrik \u2013 TCK m.216": 5,
    "Uygunsuzluk Yok": 0,
    "Veri \u0130hlali \u2013 KVKK m.12, TCK m.136": 9
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "multi_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.41.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 128000
}
