{
  "_name_or_path": "dbmdz/bert-base-turkish-cased",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Ki\u015fisel Yorum / G\u00f6zlem",
    "1": "\u015eikayet / Memnuniyetsizlik",
    "2": "Hakaret / A\u015fa\u011f\u0131lama",
    "3": "Kamuoyu Bilgilendirmesi / Uyar\u0131",
    "4": "Spam / Tan\u0131t\u0131m",
    "5": "Talep",
    "6": "Doland\u0131r\u0131c\u0131l\u0131k / Sahte Kampanya",
    "7": "Tehdit",
    "8": "Mizah / Alay",
    "9": "Taciz"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Doland\u0131r\u0131c\u0131l\u0131k / Sahte Kampanya": 6,
    "Hakaret / A\u015fa\u011f\u0131lama": 2,
    "Kamuoyu Bilgilendirmesi / Uyar\u0131": 3,
    "Ki\u015fisel Yorum / G\u00f6zlem": 0,
    "Mizah / Alay": 8,
    "Spam / Tan\u0131t\u0131m": 4,
    "Taciz": 9,
    "Talep": 5,
    "Tehdit": 7,
    "\u015eikayet / Memnuniyetsizlik": 1
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "multi_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.41.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 32000
}
